from pyecharts import options as opts
from pyecharts.charts import Map3D
from pyecharts.globals import ChartType
from pyecharts.commons.utils import JsCode

example_data = [('黑龙江', [127.9688, 45.368, 991]), ('内蒙古', [110.3467, 41.4899, 382]),
                ('吉林', [125.8154, 44.2584, 841]), ('辽宁', [123.1238, 42.1216, 2317]),
                ('河北', [114.4995, 38.1006, 3078]), ('天津', [117.4219, 39.4189, 1892]),
                ('山西', [112.3352, 37.9413, 791]), ('陕西', [109.1162, 34.2004, 1636]),
                ('甘肃', [103.5901, 36.3043, 287]), ('宁夏', [106.3586, 38.1775, 113]),
                ('青海', [101.4038, 36.8207, 57]), ('新疆', [87.9236, 43.5883, 370]), ('西藏', [91.11, 29.97, 52]),
                ('四川', [103.9526, 30.7617, 4064]), ('重庆', [108.384366, 30.439702, 2060]),
                ('山东', [117.1582, 36.8701, 3432]), ('河南', [113.4668, 34.6234, 1756]),
                ('江苏', [120.8062, 31.9208, 4936]), ('安徽', [117.29, 32.0581, 1300]),
                ('湖北', [114.3896, 30.6628, 1830]), ('浙江', [119.5313, 29.8773, 2273]),
                ('福建', [119.4543, 25.9222, 1503]), ('江西', [116.0046, 28.6633, 857]),
                ('湖南', [113.0823, 28.2568, 1504]), ('贵州', [106.6992, 26.7682, 284]),
                ('广西', [108.479, 23.1152, 1058]), ('海南', [110.3893, 19.8516, 756]),
                ('上海', [121.4648, 31.2891, 3153])]

example_data1 = [('黑龙江', [128.4688, 45.368, 49]), ('内蒙古', [110.8467, 41.4899, 50]),
                 ('吉林', [126.3154, 44.2584, 53]), ('辽宁', [123.6238, 42.1216, 161]),
                 ('河北', [114.9995, 38.1006, 348]), ('天津', [117.9219, 39.4189, 146]),
                 ('山西', [112.8352, 37.9413, 79]), ('陕西', [109.6162, 34.2004, 156]),
                 ('甘肃', [104.0901, 36.3043, 22]), ('宁夏', [106.8586, 38.1775, 4]), ('青海', [101.9038, 36.8207, 0]),
                 ('新疆', [88.4236, 43.5883, 35]), ('西藏', [91.61, 29.97, 7]), ('四川', [104.4526, 30.7617, 288]),
                 ('重庆', [108.884366, 30.439702, 167]), ('山东', [117.6582, 36.8701, 323]),
                 ('河南', [113.9668, 34.6234, 216]), ('江苏', [121.3062, 31.9208, 618]),
                 ('安徽', [117.79, 32.0581, 181]), ('湖北', [114.8896, 30.6628, 207]),
                 ('浙江', [120.0313, 29.8773, 286]), ('福建', [119.9543, 25.9222, 174]),
                 ('江西', [116.5046, 28.6633, 129]), ('湖南', [113.5823, 28.2568, 187]),
                 ('贵州', [107.1992, 26.7682, 56]), ('广西', [108.979, 23.1152, 75]), ('海南', [110.8893, 19.8516, 57]),
                 ('上海', [121.9648, 31.2891, 356])]

example_data2 = [('黑龙江', [127.4688, 45.368, 50]), ('内蒙古', [109.8467, 41.4899, 24]),
                 ('吉林', [125.3154, 44.2584, 46]), ('辽宁', [122.6238, 42.1216, 126]),
                 ('河北', [113.9995, 38.1006, 162]), ('天津', [116.9219, 39.4189, 83]),
                 ('山西', [111.8352, 37.9413, 47]), ('陕西', [108.6162, 34.2004, 110]),
                 ('甘肃', [103.0901, 36.3043, 37]), ('宁夏', [105.8586, 38.1775, 10]), ('青海', [100.9038, 36.8207, 5]),
                 ('新疆', [87.4236, 43.5883, 30]), ('西藏', [90.61, 29.97, 1]), ('四川', [103.4526, 30.7617, 283]),
                 ('重庆', [107.884366, 30.439702, 90]), ('山东', [116.6582, 36.8701, 232]),
                 ('河南', [112.9668, 34.6234, 158]), ('江苏', [120.3062, 31.9208, 370]),
                 ('安徽', [116.79, 32.0581, 105]), ('湖北', [113.8896, 30.6628, 137]),
                 ('浙江', [119.0313, 29.8773, 198]), ('福建', [118.9543, 25.9222, 154]),
                 ('江西', [115.5046, 28.6633, 79]), ('湖南', [112.5823, 28.2568, 110]),
                 ('贵州', [106.1992, 26.7682, 29]), ('广西', [107.979, 23.1152, 116]),
                 ('海南', [109.8893, 19.8516, 45]), ('上海', [120.9648, 31.2891, 287])]

example_data3 = [('黑龙江', [128.9688, 45.368, 892]), ('内蒙古', [111.3467, 41.4899, 308]),
                 ('吉林', [126.8154, 44.2584, 742]), ('辽宁', [124.1238, 42.1216, 2030]),
                 ('河北', [115.4995, 38.1006, 2568]), ('天津', [118.4219, 39.4189, 1663]),
                 ('山西', [113.3352, 37.9413, 665]), ('陕西', [110.1162, 34.2004, 1370]),
                 ('甘肃', [104.5901, 36.3043, 228]), ('宁夏', [107.3586, 38.1775, 99]),
                 ('青海', [102.4038, 36.8207, 52]), ('新疆', [88.9236, 43.5883, 305]), ('西藏', [92.11, 29.97, 44]),
                 ('四川', [104.9526, 30.7617, 3493]), ('重庆', [109.384366, 30.439702, 1803]),
                 ('山东', [118.1582, 36.8701, 2877]), ('河南', [114.4668, 34.6234, 1382]),
                 ('江苏', [121.8062, 31.9208, 3948]), ('安徽', [118.29, 32.0581, 1014]),
                 ('湖北', [115.3896, 30.6628, 1486]), ('浙江', [120.5313, 29.8773, 1789]),
                 ('福建', [120.4543, 25.9222, 1175]), ('江西', [117.0046, 28.6633, 649]),
                 ('湖南', [114.0823, 28.2568, 1207]), ('贵州', [107.6992, 26.7682, 199]),
                 ('广西', [109.479, 23.1152, 867]), ('海南', [111.3893, 19.8516, 654]),
                 ('上海', [122.4648, 31.2891, 2510])]

c = (
    Map3D()
    .add_schema(
        itemstyle_opts=opts.ItemStyleOpts(

            color="rgb(39,117,182)",  # 地图基调颜色
            opacity=1,

            border_width=0.8,  # 线条粗度
            border_color="rgb(249,223,205)",  # 分界线颜色
        ),

        map3d_label=opts.Map3DLabelOpts(
            is_show=False,
            formatter=JsCode("function(data){return data.name + ' ' + data.value[2];}"),
        ),
        emphasis_label_opts=opts.LabelOpts(
            is_show=False,
            color="#fff",  # 柱子上标颜色
            font_size=5,
            background_color="rgba(255,127,80,0.4)",
        ),
        light_opts=opts.Map3DLightOpts(
            main_color="#fff",  # 亮光的颜色
            main_intensity=1.2,
            main_shadow_quality="high",
            is_main_shadow=False,
            main_beta=15,
            ambient_intensity=0.5,
        ),
    )
    .add(
        series_name="评价总数",
        data_pair=example_data,
        type_=ChartType.BAR3D,
        bar_size=0.8,
        shading="lambert",
        itemstyle_opts=opts.ItemStyleOpts(color == 'rgb(255,0,0)'),  # 设置柱状图的颜色为红色
        label_opts=opts.LabelOpts(
            is_show=True,
            formatter=JsCode("function(data){return data.name + ' ' + data.value[2];}"),
        ),
    )
    .add(
        series_name="好评",
        data_pair=example_data3,
        type_=ChartType.BAR3D,
        bar_size=0.8,
        shading="lambert",
        itemstyle_opts=opts.ItemStyleOpts(color='rgb(0,255,0)'),  # 设置柱状图的颜色为黄色
        label_opts=opts.LabelOpts(
            is_show=True,
            formatter=JsCode("function(data){return data.name + ' ' + data.value[2];}"),
        ),
        min_height=1,
        bevel_smoothness=2,

    )
    .add(
        series_name="差评",
        data_pair=example_data1,
        type_=ChartType.BAR3D,
        bar_size=0.8,
        shading="lambert",
        itemstyle_opts=opts.ItemStyleOpts(color='rgb(0,0,0)'),  # 设置柱状图的颜色为黑色
        label_opts=opts.LabelOpts(
            is_show=True,
            formatter=JsCode("function(data){return data.name + ' ' + data.value[2];}"),
        ),
        min_height=0.5
    )

    .add(
        series_name="中评",
        data_pair=example_data2,
        type_=ChartType.BAR3D,
        bar_size=0.8,
        shading="lambert",
        itemstyle_opts=opts.ItemStyleOpts(color='rgb(255,255,0)'),  # 设置柱状图的颜色为绿色
        label_opts=opts.LabelOpts(
            is_show=True,
            formatter=JsCode("function(data){return data.name + ' ' + data.value[2];}"),
        ),
        min_height=0.5
    )
    .set_global_opts(title_opts=opts.TitleOpts(title="2023年中国不同地区对非遗产品评论层级数量的地区分布三维柱状地图"))
    .render_notebook()
)
C

